# Pérdida de datos

In [7]:
import numpy as np
import pandas as pd

In [9]:
df= pd.DataFrame({
    'A': [7, 8, -5, 8],
    'B': [12, np.nan, 1, np.nan],
    'C': [4, np.nan, np.nan, np.nan],
    'D': [4, np.nan, -2,-10]
})
df

   A     B    C     D
0  7  12.0  4.0   4.0
1  8   NaN  NaN   NaN
2 -5   1.0  NaN  -2.0
3  8   NaN  NaN -10.0

In [11]:
# comprobamos los registros nulos
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False   True   True   True
2  False  False   True  False
3  False   True   True  False

In [13]:
# descartar filas con registros nulos
df.dropna()

   A     B    C    D
0  7  12.0  4.0  4.0

In [15]:
# descartar columnas con registros nulos
df.dropna(axis= 1)

   A
0  7
1  8
2 -5
3  8

In [17]:
# mostrar filas con un mínimo de registros no nulos
df.dropna(thresh= 2)

   A     B    C     D
0  7  12.0  4.0   4.0
2 -5   1.0  NaN  -2.0
3  8   NaN  NaN -10.0

In [19]:
# rellenar los registros de las filas vacías, útil!!!
df.fillna(value= 0)

   A     B    C     D
0  7  12.0  4.0   4.0
1  8   0.0  0.0   0.0
2 -5   1.0  0.0  -2.0
3  8   0.0  0.0 -10.0

In [21]:
# rellenar esos registros de las filas vacías con el valor mínimo de una columna
df['B'].fillna(value= df['B'].min())

0    12.0
1     1.0
2     1.0
3     1.0
Name: B, dtype: float64

In [27]:
df.fillna(value= df['D'].min()) # Rellenar todo el dataframe con el valor mínimo de una columna

   A     B     C     D
0  7  12.0   4.0   4.0
1  8 -10.0 -10.0 -10.0
2 -5   1.0 -10.0  -2.0
3  8 -10.0 -10.0 -10.0